a1=5
b1=5

print(a1-5 or b1-3)
print(a1<6 or b1+3)
print(not a1)

print("###############################")
a2=3
b2=60
c2=3
list1=[1,2,3,4,5,6,7,8]
print(a2 in list1)
print(a2 not in list1)
print(b2 in list1)
print(b2 not in list1)
print(id(a2))
print(a2 is b2) #false
print(a2 is c2) #true
print(a2==b2)

# 位运算符
print("位运算符")
w1=1 #0001
w2=2 #0010
print(w1&w2) #0001&0010=0000 按位与运算符。参与运算的两个二进制位均为1时，结果位才为1，否则为0
print(w1|w2) #0001|0010=0011 按位或运算符。参与运算的两个二进制位有一个为1时，结果位就为1，否则为0
print(w1^w2) #0001^0010=0011 按位异或运算符。参与运算的两个二进制位不同时，结果位就为1，否则为0
print(~w1) #~0001=1110 按位取反运算符。对操作数的每个二进制位进行取反操作，即0变1，1变0
print(w1<<2) #0001<<2=0100 左移运算符。将操作数的二进制位向左移动指定的位数，高位丢弃，低位补0
print(w1>>2) #0001>>2=0000 右移运算符。将操作数的二进制位向右移动指定的位数，低位丢弃，高位补0

print("############################")
x=3
x*=x+5
a=3
b=5
c=2
print(not(b<c) and a>c)# 如果b<c，且a>c，则结果为True
